Revit 2026 API

# WorksetPreviewName Property

---

Name of the workset.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string Name { get; }
```
```vb
Public ReadOnly Property Name As String
	Get
```
```cpp
public:
property String^ Name {
	String^ get ();
}
```
```fsharp
member Name : string with get
```

#### Property Value

String

Name is case-insensitive.

#### Reference

WorksetPreview Class

Autodesk.Revit.DB Namespace